KonstantinChizhov/Mcucpp/mcucpp/ARM/MDR32Fx/MDR32Fx.h
/** @} */ /* End of group __MDR32Fx_Peripheral_Units */


/** @defgroup __Peripheral_Memory_Map Peripheral Memory Map
  * @{
  */

#define MDR_CAN1_BASE       (0x40000000)
#define MDR_CAN2_BASE       (0x40008000)
#define MDR_USB_BASE        (0x40010000)
#define MDR_EEPROM_BASE     (0x40018000)
#define MDR_RST_CLK_BASE    (0x40020000)
#define MDR_DMA_BASE        (0x40028000)
#define MDR_UART1_BASE      (0x40030000)
#define MDR_UART2_BASE      (0x40038000)
#define MDR_SSP1_BASE       (0x40040000)
#define MDR_I2C_BASE        (0x40050000)
#define MDR_POWER_BASE      (0x40058000)
#define MDR_WWDG_BASE       (0x40060000)
#define MDR_IWDG_BASE       (0x40068000)
#define MDR_TIMER1_BASE     (0x40070000)
#define MDR_TIMER2_BASE     (0x40078000)
#define MDR_TIMER3_BASE     (0x40080000)
#define MDR_ADC_BASE        (0x40088000)
#define MDR_DAC_BASE        (0x40090000)
#define MDR_COMP_BASE       (0x40098000)
#define MDR_SSP2_BASE       (0x400A0000)
#define MDR_PORTA_BASE      (0x400A8000)
#define MDR_PORTB_BASE      (0x400B0000)
#define MDR_PORTC_BASE      (0x400B8000)
#define MDR_PORTD_BASE      (0x400C0000)
#define MDR_PORTE_BASE      (0x400C8000)
#define MDR_BKP_BASE        (0x400D8000)
#define MDR_PORTF_BASE      (0x400E8000)
#define MDR_EBC_BASE        (0x400F0000)

/** @} */ /* End of group __Peripheral_Memory_Map */

/** @defgroup __Peripheral_declaration Peripheral declaration
  * @{
  */

#define MDR_CAN1            ((MDR_CAN_TypeDef     *) MDR_CAN1_BASE)
#define MDR_CAN2            ((MDR_CAN_TypeDef     *) MDR_CAN2_BASE)
#define MDR_USB             ((MDR_USB_TypeDef     *) MDR_USB_BASE)
#define MDR_EEPROM          ((MDR_EEPROM_TypeDef  *) MDR_EEPROM_BASE)
#define MDR_RST_CLK         ((MDR_RST_CLK_TypeDef *) MDR_RST_CLK_BASE)
#define MDR_DMA             ((MDR_DMA_TypeDef     *) MDR_DMA_BASE)
#define MDR_UART1           ((MDR_UART_TypeDef    *) MDR_UART1_BASE)
#define MDR_UART2           ((MDR_UART_TypeDef    *) MDR_UART2_BASE)
#define MDR_SSP1            ((MDR_SSP_TypeDef     *) MDR_SSP1_BASE)
#define MDR_I2C             ((MDR_I2C_TypeDef     *) MDR_I2C_BASE)
#define MDR_POWER           ((MDR_POWER_TypeDef   *) MDR_POWER_BASE)
#define MDR_WWDG            ((MDR_WWDG_TypeDef    *) MDR_WWDG_BASE)
#define MDR_IWDG            ((MDR_IWDG_TypeDef    *) MDR_IWDG_BASE)
#define MDR_TIMER1          ((MDR_TIMER_TypeDef   *) MDR_TIMER1_BASE)
#define MDR_TIMER2          ((MDR_TIMER_TypeDef   *) MDR_TIMER2_BASE)
#define MDR_TIMER3          ((MDR_TIMER_TypeDef   *) MDR_TIMER3_BASE)
#define MDR_ADC             ((MDR_ADC_TypeDef     *) MDR_ADC_BASE)
#define MDR_DAC             ((MDR_DAC_TypeDef     *) MDR_DAC_BASE)
#define MDR_COMP            ((MDR_COMP_TypeDef    *) MDR_COMP_BASE)
#define MDR_SSP2            ((MDR_SSP_TypeDef     *) MDR_SSP2_BASE)
#define MDR_PORTA           ((MDR_PORT_TypeDef    *) MDR_PORTA_BASE)
#define MDR_PORTB           ((MDR_PORT_TypeDef    *) MDR_PORTB_BASE)
#define MDR_PORTC           ((MDR_PORT_TypeDef    *) MDR_PORTC_BASE)
#define MDR_PORTD           ((MDR_PORT_TypeDef    *) MDR_PORTD_BASE)
#define MDR_PORTE           ((MDR_PORT_TypeDef    *) MDR_PORTE_BASE)
#define MDR_BKP             ((MDR_BKP_TypeDef     *) MDR_BKP_BASE)
#define MDR_PORTF           ((MDR_PORT_TypeDef    *) MDR_PORTF_BASE)
#define MDR_EBC             ((MDR_EBC_TypeDef     *) MDR_EBC_BASE)

/** @} */ /* End of group __Peripheral_declaration */

#ifdef __cplusplus
}
#endif

/** @} */ /* End of group __MDR32Fx */

/** @} */ /* End of group __CMSIS */

#endif /* __MDR32FX_H */

/******************* (C) COPYRIGHT 2010 Phyton *********************************
*
* END OF FILE MDR32Fx.h */
